// - за допомогою циклу вивести в консоль всі парні значення числа 20
for(let i=1; i<21; i++){
    if(i%2 == 0 ){
        // console.log(i);
    }
}

// - використовуючи цикл виведіть суму чисел між  А і В з умовоб що A<B
let B = 4;
let summ = 0;
for (let A = 2; A < B; A++) {
    // summ +=A;
    summ = summ + A;
}
// console.log(summ);

for(let i=10; i>0; i--){
    console.log(i);
}

// - Створити цикл який виводить значення в консоль з масивів в такому  форматі "Сьогодні ....  у вас такі плани ..." 
let days = ["Понеділок", "Середа", "Неділя"] 
let plans = ["Урок 03", "Урок 04", "Вихідни"]

for(let item = 0; item<days.length; item++){
    console.log(`Сьогодні ${days[item]}  у вас такі плани ${plans[item]}`);


}

// - Написати цикл який замінює відємне значення в масиві на 0  
let checkArr = [-69, -96, -66, 77, 85, -85, 14, -20, -90, -36];

for(let i = 0; i<checkArr.length; i++){
    if(checkArr[i]<0){
        checkArr[i] = 0;
    }
}

console.log(checkArr);

// - створити switch  в якому є назви планет сонячної системи. Якщо користувач вводить назву планети сонячної системи то виводити ця планета в сонячній системі. Якщо такої планети нема то виводити: такої планети нема в сонячній системі
// Додаткові завдання видам за умови зробленого основного завдання.

let planetName = prompt('Напишіть назву планети');

switch(planetName){
    case'Меркурій':
    case'меркурій':
    case 'Венера':
        console.log(`${planetName} є планетою соняшної системи`);
        break;
    default:
        console.log('невідоме значення');
}

// fed-pro-1810-2023

// html & css
// fe-start-1309-m